<br><br><br><br>
# Set up the environment

In [63]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [64]:
%%sql postgresql://postgres:mysecretpassword@localhost/postgres

select 'hi there' as "message";

1 rows affected.

[('hi there',)]

<br><br><br><br>
# Set up tables

In [65]:
%%sql

drop table if exists transactions;
create table transactions (
    transaction_id serial primary key,
    user_id        text,
    merchant       text,
    amount         numeric,
    when_created   timestamp
);

drop table if exists transactions_history;
create table transactions_history (
    operation char(6) not null,
    when_modified  timestamp not null,
    
    transaction_id int,
    user_id        text,
    merchant       text,
    amount         numeric,
    when_created   timestamp
);

 * postgresql://postgres:***@localhost/postgres
Done.
Done.
Done.
Done.

[]

In [71]:
%%sql

CREATE OR REPLACE FUNCTION capture_transactions_history() RETURNS TRIGGER AS $transactions_history$
    BEGIN
        IF (TG_OP = 'DELETE') THEN
            INSERT INTO transactions_history SELECT 'delete', now(), OLD.*;
            RETURN OLD;
        ELSIF (TG_OP = 'UPDATE') THEN
            INSERT INTO transactions_history SELECT 'update', now(), NEW.*;
            RETURN NEW;
        ELSIF (TG_OP = 'INSERT') THEN
            INSERT INTO transactions_history SELECT 'insert', now(), NEW.*;
            RETURN NEW;
        END IF;
        RETURN NULL; -- result is ignored since this is an AFTER trigger
    END;
$transactions_history$ LANGUAGE plpgsql;

DROP TRIGGER IF EXISTS transactions_history ON users;
CREATE TRIGGER transactions_history
AFTER INSERT OR UPDATE OR DELETE ON transactions
    FOR EACH ROW EXECUTE PROCEDURE capture_transactions_history();

 * postgresql://postgres:***@localhost/postgres
Done.
Done.
Done.

[]

In [72]:
%%sql

describe table transactions;

 * postgresql://postgres:***@localhost/postgres
(psycopg2.ProgrammingError) syntax error at or near "describe"
LINE 1: describe table transactions;
        ^
 [SQL: 'describe table transactions;'] (Background on this error at: http://sqlalche.me/e/f405)

In [98]:
%%sql

delete from transactions;
insert into transactions (user_id, merchant, amount, when_created) values 
  ('jill', 'BP', 43.22, '2018-01-01 10:00'),
  ('jill', 'Magic Mountain', 24.11, '2018-01-01 14:30'),
  ('jill', 'Target', 2.00, '2018-01-01 10:30'),
  ('jane', 'Starbucks', 4.39, '2018-01-03 06:11'),
  ('jane', 'COTA', 20.00, '2018-01-03 06:15'),
  ('jane', 'Jeni Ice Cream', 7.23, '2018-01-04 15:12');

 * postgresql://postgres:***@localhost/postgres
6 rows affected.
6 rows affected.

[]

In [124]:
%%sql

select * from transactions;

 * postgresql://postgres:***@localhost/postgres
6 rows affected.

[(29, 'jill', 'BP', Decimal('43.22'), datetime.datetime(2018, 1, 1, 10, 0)),
 (30, 'jill', 'Magic Mountain', Decimal('24.11'), datetime.datetime(2018, 1, 1, 14, 30)),
 (31, 'jill', 'Target', Decimal('2.00'), datetime.datetime(2018, 1, 1, 10, 30)),
 (32, 'jane', 'Starbucks', Decimal('4.39'), datetime.datetime(2018, 1, 3, 6, 11)),
 (33, 'jane', 'COTA', Decimal('20.00'), datetime.datetime(2018, 1, 3, 6, 15)),
 (34, 'jane', 'Jeni Ice Cream', Decimal('7.23'), datetime.datetime(2018, 1, 4, 15, 12))]

In [125]:
%%sql

select * from transactions_history where transaction_id = 3;

 * postgresql://postgres:***@localhost/postgres
2 rows affected.

[('insert', datetime.datetime(2018, 10, 17, 14, 9, 33, 335263), 3, 'jill', 'BP', Decimal('43.22'), datetime.datetime(2018, 1, 1, 10, 0)),
 ('delete', datetime.datetime(2018, 10, 17, 14, 14, 28, 978230), 3, 'jill', 'BP', Decimal('43.22'), datetime.datetime(2018, 1, 1, 10, 0))]

<br/><br/><br/><br/>

# Aggregate functions (good old GROUP BY)

In [134]:
%%sql

select sum(amount) 
from transactions;

 * postgresql://postgres:***@localhost/postgres
1 rows affected.

[(Decimal('101.95'),)]

In [89]:
%%sql

select user_id, sum(amount) 
from transactions 
group by user_id;

 * postgresql://postgres:***@localhost/postgres
2 rows affected.

[('jill', Decimal('69.33')), ('jane', Decimal('31.62'))]

In [91]:
%%sql

select user_id, when_created::date, sum(amount) 
from transactions 
group by 1, 2
order by 1, 2;

 * postgresql://postgres:***@localhost/postgres
3 rows affected.

[('jane', datetime.date(2018, 1, 3), Decimal('24.39')),
 ('jane', datetime.date(2018, 1, 4), Decimal('7.23')),
 ('jill', datetime.date(2018, 1, 1), Decimal('69.33'))]

In [95]:
%%sql

select sum(amount) over ()
from transactions;

 * postgresql://postgres:***@localhost/postgres
6 rows affected.

[(Decimal('100.95'),),
 (Decimal('100.95'),),
 (Decimal('100.95'),),
 (Decimal('100.95'),),
 (Decimal('100.95'),),
 (Decimal('100.95'),)]

In [96]:
%%sql

select *, sum(amount) over ()
from transactions;

 * postgresql://postgres:***@localhost/postgres
6 rows affected.

[(23, 'jill', 'BP', Decimal('43.22'), datetime.datetime(2018, 1, 1, 10, 0), Decimal('100.95')),
 (24, 'jill', 'Target', Decimal('2.00'), datetime.datetime(2018, 1, 1, 10, 30), Decimal('100.95')),
 (25, 'jill', 'Magic Mountain', Decimal('24.11'), datetime.datetime(2018, 1, 1, 14, 30), Decimal('100.95')),
 (26, 'jane', 'Starbucks', Decimal('4.39'), datetime.datetime(2018, 1, 3, 6, 11), Decimal('100.95')),
 (27, 'jane', 'COTA', Decimal('20.00'), datetime.datetime(2018, 1, 3, 6, 15), Decimal('100.95')),
 (28, 'jane', 'Jeni Ice Cream', Decimal('7.23'), datetime.datetime(2018, 1, 4, 15, 12), Decimal('100.95'))]

In [99]:
%%sql

select *, 
sum(amount) over (partition by user_id)
from transactions;

 * postgresql://postgres:***@localhost/postgres
6 rows affected.

[(32, 'jane', 'Starbucks', Decimal('4.39'), datetime.datetime(2018, 1, 3, 6, 11), Decimal('31.62')),
 (33, 'jane', 'COTA', Decimal('20.00'), datetime.datetime(2018, 1, 3, 6, 15), Decimal('31.62')),
 (34, 'jane', 'Jeni Ice Cream', Decimal('7.23'), datetime.datetime(2018, 1, 4, 15, 12), Decimal('31.62')),
 (29, 'jill', 'BP', Decimal('43.22'), datetime.datetime(2018, 1, 1, 10, 0), Decimal('69.33')),
 (30, 'jill', 'Magic Mountain', Decimal('24.11'), datetime.datetime(2018, 1, 1, 14, 30), Decimal('69.33')),
 (31, 'jill', 'Target', Decimal('2.00'), datetime.datetime(2018, 1, 1, 10, 30), Decimal('69.33'))]

In [101]:
%%sql

select *, 
sum(amount) over (
    partition by user_id
    rows between unbounded preceding and current row
)
from transactions;

 * postgresql://postgres:***@localhost/postgres
6 rows affected.

[(32, 'jane', 'Starbucks', Decimal('4.39'), datetime.datetime(2018, 1, 3, 6, 11), Decimal('4.39')),
 (33, 'jane', 'COTA', Decimal('20.00'), datetime.datetime(2018, 1, 3, 6, 15), Decimal('24.39')),
 (34, 'jane', 'Jeni Ice Cream', Decimal('7.23'), datetime.datetime(2018, 1, 4, 15, 12), Decimal('31.62')),
 (29, 'jill', 'BP', Decimal('43.22'), datetime.datetime(2018, 1, 1, 10, 0), Decimal('43.22')),
 (30, 'jill', 'Magic Mountain', Decimal('24.11'), datetime.datetime(2018, 1, 1, 14, 30), Decimal('67.33')),
 (31, 'jill', 'Target', Decimal('2.00'), datetime.datetime(2018, 1, 1, 10, 30), Decimal('69.33'))]

In [104]:
%%sql

select *, 
sum(amount) over (
    partition by user_id
    order by when_created
    rows between unbounded preceding and current row
)
from transactions;

 * postgresql://postgres:***@localhost/postgres
6 rows affected.

[(32, 'jane', 'Starbucks', Decimal('4.39'), datetime.datetime(2018, 1, 3, 6, 11), Decimal('4.39')),
 (33, 'jane', 'COTA', Decimal('20.00'), datetime.datetime(2018, 1, 3, 6, 15), Decimal('24.39')),
 (34, 'jane', 'Jeni Ice Cream', Decimal('7.23'), datetime.datetime(2018, 1, 4, 15, 12), Decimal('31.62')),
 (29, 'jill', 'BP', Decimal('43.22'), datetime.datetime(2018, 1, 1, 10, 0), Decimal('43.22')),
 (31, 'jill', 'Target', Decimal('2.00'), datetime.datetime(2018, 1, 1, 10, 30), Decimal('45.22')),
 (30, 'jill', 'Magic Mountain', Decimal('24.11'), datetime.datetime(2018, 1, 1, 14, 30), Decimal('69.33'))]

In [109]:
%%sql

select *, 
row_number() over (
    partition by user_id
    order by when_created
    rows between unbounded preceding and unbounded following
)
from transactions;

 * postgresql://postgres:***@localhost/postgres
6 rows affected.

[(32, 'jane', 'Starbucks', Decimal('4.39'), datetime.datetime(2018, 1, 3, 6, 11), 1),
 (33, 'jane', 'COTA', Decimal('20.00'), datetime.datetime(2018, 1, 3, 6, 15), 2),
 (34, 'jane', 'Jeni Ice Cream', Decimal('7.23'), datetime.datetime(2018, 1, 4, 15, 12), 3),
 (29, 'jill', 'BP', Decimal('43.22'), datetime.datetime(2018, 1, 1, 10, 0), 1),
 (31, 'jill', 'Target', Decimal('2.00'), datetime.datetime(2018, 1, 1, 10, 30), 2),
 (30, 'jill', 'Magic Mountain', Decimal('24.11'), datetime.datetime(2018, 1, 1, 14, 30), 3)]

In [132]:
%%sql

select transaction_id, user_id, merchant, amount, when_created
from (
    select *, 
    row_number() over (
        partition by transaction_id
        order by when_modified desc
        rows between unbounded preceding and unbounded following
    ) as n
    from transactions_history
) as latest
where n = 1
and operation != 'delete'
;

 * postgresql://postgres:***@localhost/postgres
6 rows affected.

[(29, 'jill', 'BP', Decimal('43.22'), datetime.datetime(2018, 1, 1, 10, 0)),
 (30, 'jill', 'Magic Mountain', Decimal('24.11'), datetime.datetime(2018, 1, 1, 14, 30)),
 (31, 'jill', 'Target', Decimal('2.00'), datetime.datetime(2018, 1, 1, 10, 30)),
 (32, 'jane', 'Starbucks', Decimal('5.39'), datetime.datetime(2018, 1, 3, 6, 11)),
 (33, 'jane', 'COTA', Decimal('20.00'), datetime.datetime(2018, 1, 3, 6, 15)),
 (34, 'jane', 'Jeni Ice Cream', Decimal('7.23'), datetime.datetime(2018, 1, 4, 15, 12))]

In [129]:
%%sql

update transactions set amount = 5.39 where transaction_id = 32;

 * postgresql://postgres:***@localhost/postgres
1 rows affected.

[]

Export the transactions_history table using PostgreSQL's `pg_dump` shell utility. We will be able to replay this into Redshift.

```
PGUSER=postgres PGPASSWORD=mysecretpassword pg_dump \
  --host localhost
  --port 5432
  --dbname postgres \
  --table transactions_history \
  --column-inserts \
  > dumpfile.sql
```